# Brewfile - Modern development environment
# Install with: brew bundle --file=~/dotfiles/Brewfile

# ============================================
# Taps
# ============================================
tap "homebrew/bundle"

# ============================================
# Core CLI Tools (Modern Replacements)
# ============================================
brew "bat"          # Better cat - syntax highlighting, line numbers
brew "eza"          # Better ls - icons, git integration, colors
brew "fd"           # Better find - faster, intuitive syntax
brew "ripgrep"      # Better grep - blazing fast, respects .gitignore
brew "fzf"          # Fuzzy finder - search anything
brew "zoxide"       # Better cd - remembers your frequent directories
brew "delta"        # Better git diff - side-by-side, syntax highlighting

# ============================================
# Git & Development Tools
# ============================================
brew "lazygit"      # Terminal UI for git - visual, interactive
brew "gh"           # GitHub CLI - PRs, issues, actions from terminal

# ============================================
# Shell & Prompt
# ============================================
brew "starship"     # Cross-shell prompt - fast (Rust), beautiful

# ============================================
# Shell Enhancements
# ============================================
brew "thefuck"      # Corrects your previous command typos
brew "atuin"        # Magical shell history - sync, search, stats

# ============================================
# Utilities
# ============================================
brew "chezmoi"      # Dotfiles manager
brew "jq"           # JSON processor
brew "tldr"         # Simplified man pages - community examples
brew "tree"         # Directory tree viewer
brew "wget"         # HTTP downloader
brew "htop"         # Better top - interactive process viewer

# ============================================
# Fonts (Nerd Fonts for icons in prompt/terminal)
# ============================================
cask "font-meslo-lg-nerd-font"        # Primary - clean, readable
cask "font-fira-code-nerd-font"       # Alternative - with ligatures
cask "font-jetbrains-mono-nerd-font"  # Alternative - developer favorite
